#+TITLE: Emacs-Lisp Introduction
#+tags: emacs lisp

Let me introduce about elisp programming.
...

* 버퍼 관련 코드에 대한 이해
#+BEGIN_SRC emacs-lisp
(message "hello world!")
#+END_SRC

#+RESULTS:
: hello world

#+BEGIN_SRC emacs-lisp
(message "fill-column: %d" fill-column)
#+END_SRC

#+RESULTS:
: fill-column: 80

#+BEGIN_SRC emacs-lisp
; set function reqruies quoted first argument
(set 'carnivores '(lion tiger leopard))
; setq special form add automatically quote to the first argument
(setq carnivores '(lion tiger leopard))
(setq trees '(pine fir oak maple)
      herbivores '(gazelle antelope zebra))
#+END_SRC

#+RESULTS:
| gazelle | antelope | zebra |

#+BEGIN_SRC emacs-lisp
; Do C-x and C-e to evaluate elisp expression in any buffer
(buffer-name)
(buffer-file-name)
; Do C-u, C-x, C-e if you want to print the result beside the expression
; Use SPC-u instead of C-u in evil mode becasue C-u is used for scroll-up
#+END_SRC

#+BEGIN_SRC emacs-lisp
(current-buffer)
(other-buffer)
(switch-to-buffer (other-buffer))
(switch-to-buffer (other-buffer (current-buffer) t))
(buffer-size)
(point) ;; current position of cursor in the buffer
(point-min)
(point-max)
#+END_SRC


#+BEGIN_SRC emacs-lisp
; interactive function definition
; you can call the function as typing C-u 3 M-x multiply-by-seven after evaluating below definition
; with the prefix number as 3, you will get the result 29
; you can use the Meta followed by the number in place of C-u followed by the number
(defun multiply-by-seven (number)  ; Interactive version.
  "Multiply NUMBER by seven."
  (interactive "p") ; in here "p" tells Emacs to pass the prefix argument to the function and use its value for the argument of the function
  (message "The result is %d" (* 7 number)))
; when the function requires more than one arguments and be interactive,
; the interative special form expresses multiple prefixes seperated by '\n' in the string form,
; for example, "p\ncZap To Char: " indicates the first one as a number and the second one as a character with the prompt "Zap To Char: "
#+END_SRC

#+RESULTS:
: multiply-by-seven


#+BEGIN_SRC emacs-lisp
(defun simplified-beginning-of-buffer ()
  "simplified beginning of buffer function"
  (interactive)
  (push-mark)
  (goto-char (point-min)))

(defun mark-whole-buffer-2 ()
  "sample code"
  (interactive)
  (push-mark (point))
  (push-mark (point-max) nil t)
  (goto-char (point-min)))
#+END_SRC

#+RESULTS:
: mark-whole-region2

